[
  {
    "id": 1,
    "name": "Cards Royale",
    "src": [
      "/projects/cardsRoyale/screen1.png",
      "/projects/cardsRoyale/screen2.png"
    ],
    "skills": [
      "pgAdmin",
      "PHP",
      "JavaScript",
      "Excel",
      "VS Code",
      "HTML",
      "SQL",
      "CSS",
      "GitHub"
    ],
    "dsc": "Cards Royale is a personal project that I developed from scratch. The concept of the game involves searching for a specific card from the game Clash Royale by making educated guesses. With each guess, players receive feedback on whether the characteristics of their guess match those of the target card. As the game progresses, players receive additional clues to help them identify the correct card. I got inspired to create this game after encountering a similar one based on characters from another game. I decided to customize it to Cards Royale and started by collecting all the necessary data. I organized the data in an Excel spreadsheet and then created a database using PgAdmin4, populating it with the information from Excel. The development process involved coding the game's functionality and subsequently designing the website's visuals. I prioritized enhancing the user experience, and as of December 2023, the website is almost complete, with just a few minor details remaining. At this point, the game is fully playable. Throughout this project, I delved into PHP, gaining exposure to it just before formal education on the subject at school. Additionally, I honed my skills in code debugging within the browser console. I thoroughly enjoyed crafting the game's interface and implementing various user experience improvements. Notably, I incorporated AJAX into the backend after learning about it in school, further enhancing the project's capabilities. Overall, this endeavor has been a valuable learning experience, allowing me to explore new technologies, improve my coding skills, and create an engaging game interface.",
    "github": [
      "https://github.com/EvrardThibaud/ProjetCarteCR",
      "https://github.com/EvrardThibaud/CardsRoyale"
    ]
  },
  {
    "id": 2,
    "name": "EventPlanner+",
    "src": [
      "/projects/eventPlanner/screen1.png",
      "/projects/eventPlanner/screen2.png",
      "/projects/eventPlanner/screen3.png",
      "/projects/eventPlanner/screen4.png",
      "/projects/eventPlanner/screen5.png",
      "/projects/eventPlanner/screen6.png",
      "/projects/eventPlanner/screen7.png",
      "/projects/eventPlanner/screen8.png",
      "/projects/eventPlanner/screen9.png"
    ],
    "skills": [
      "Vue.js",
      "Vite",
      "Node.js",
      "JavaScript",
      "CSS",
      "GitHub",
      "VS Code",
      "HTML",
      "Sass",
      "Tailwind",
      "DaisyUI"
    ],
    "dsc": "",
    "github": ["https://github.com/EvrardThibaud/event-planner"]
  },
  {
    "id": 3,
    "name": "HelpHub",
    "src": [],
    "skills": [
      "Laravel",
      "Azure DevOps",
      "SQL",
      "PowerAMC",
      "JavaScript",
      "CSS",
      "PHP",
      "VS Code",
      "pgAdmin",
      "GitHub",
      "HTML",
      "Excel"
    ],
    "dsc": "HelpHub is a school project that took place during the first semester of my second year in computer science studies. I was part of a group of four students working on this project. The objective was to create a website where associations could post volunteering or donation opportunities, and anyone could volunteer their help to any association. Initially, we created diagrams (BPMN) for project and team organization. Following that, we developed the database diagram using Merise. Simultaneously, we generated a dataset using Excel and generatedata.com to populate our database with SQL. To enhance our project's analytical capabilities, we used Power BI to simulate statistics with our dataset. We then delved into website development using Laravel, implementing Breeze to set up the authentication system.Additionally, we addressed the legal aspects of the website, including cookies, GDPR compliance, Privacy Policy, and Terms of Use. We adopted the Scrum agile methodology with sprint reviews. As of the current writing in December 2023, the project is not yet complete. We still need to finish the website, implement the cryptography part for security, and create the communication section, which includes a user guide.This project provided me with valuable insights and a practical understanding of how to approach a project, similar to what I might encounter in a professional setting. It taught me how to work effectively in a team, follow agile methods, manage deadlines, and handle multiple tasks simultaneously. Furthermore, it enhanced my skills with various software tools and programming languages that we utilized.",
    "github": []
  },
  {
    "id": 4,
    "name": "Fifa Store",
    "src": ["/projects/fifa/screen1.png"],
    "skills": [
      "Vue.js",
      "Tailwind",
      "C#",
      "Vite",
      "JavaScript",
      "DaisyUI",
      "CSS",
      "GitHub",
      "Visual Studio",
      "VS Code",
      "HTML",
      "Azure DevOps"
    ],
    "dsc": "",
    "github": [
      "https://github.com/EvrardThibaud/SAE401_FIFA",
      "https://github.com/EvrardThibaud/SAE401_FIFA_BACK",
      "https://github.com/EvrardThibaud/SAE401_FIFA_FRONT"
    ]
  }
]
